---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStyle
source: html/32741af1-9b3b-28da-9882-519c5e9ba3f5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemHookStyle Property

"Style"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemHookStyle { get; }
```